namespace DatingAgencyMS.Client.Constants;

public static class ClientsConstants
{
    /// <summary>
    /// За додатковою інформацією і описом всіх термінів - https://ua.pronouns.page/terminology
    /// </summary>
    public static readonly string[] Genders =
    [
        "Агендер",
        "Андрогін",
        "Бігендер",
        "Цисгендер",
        "Цисгендерна небінарна особа",
        "Демігендер",
        "Джендерквір",
        "Гендерфлюїд",
        "Гендернеконформна особа",
        "Інтерсексуальна особа",
        "Нонбінарна особа",
        "Пангендер",
        "Полігендер",
        "Трансгендерна жінка",
        "Трансгендерний чоловік"
    ];

    public static readonly string[] Orientations =
    [
        "Гетеросексуальність",
        "Гомосексуальність",
        "Бісексуальність",
        "Пансексуальність",
        "Асексуальність",
        "Демісексуальність",
        "Полісексуальність",
        "Квір",
        "Грейсексуальність",
        "Автосексуальність",
        "Сколіосексуальність",
        "Андросексуальність",
        "Гінекосексуальність"
    ];

    public static readonly Dictionary<string, string[]> OrientationsCompatibilityDictionary = new()
    {
        { "Гетеросексуальність", ["Бісексуальність", "Пансексуальність", "Гетеросексуальність"] },
        { "Гомосексуальність", ["Бісексуальність", "Пансексуальність", "Гомосексуальність"] },
        { "Бісексуальність", ["Гетеросексуальність", "Гомосексуальність", "Пансексуальність", "Бісексуальність"] },
        { "Пансексуальність", ["Гетеросексуальність", "Гомосексуальність", "Бісексуальність", "Пансексуальність"] },
        { "Асексуальність", ["Асексуальність", "Демісексуальність", "Грейсексуальність"] },
        { "Демісексуальність", ["Асексуальність", "Демісексуальність", "Грейсексуальність"] },
        { "Полісексуальність", ["Бісексуальність", "Пансексуальність", "Полісексуальність"] },
        { "Квір", ["Гетеросексуальність", "Гомосексуальність", "Бісексуальність", "Пансексуальність", "Квір"] },
        { "Грейсексуальність", ["Асексуальність", "Демісексуальність", "Грейсексуальність"] },
        { "Автосексуальність", ["Автосексуальність"] },
        { "Сколіосексуальність", ["Сколіосексуальність"] },
        { "Андросексуальність", ["Андросексуальність"] },
        { "Гінекосексуальність", ["Гінекосексуальність"] }
    };
}